tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/cask"

cask "java"

brew "acme"
brew "automake"
brew "awscli"
brew "bats"
brew "bfg"
brew "bison"
brew "caddy"
brew "certbot"
brew "cfssl"
brew "chruby"
brew "circleci"
brew "cli53"
brew "codeclimate"
brew "coreutils"
brew "csshx"
brew "ctop"
brew "diff-so-fancy"
brew "eksctl"
brew "findutils"
brew "gdbm"
brew "gettext"
brew "git-flow"
brew "git-utils"
brew "git"
brew "go"
brew "grc"
brew "heroku-node"
brew "heroku"
brew "htop-osx"
brew "httpie"
brew "hub"
brew "hyper"
brew "iperf3"
brew "jq"
brew "k6"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "lame"
brew "libffi"
brew "libiconv"
brew "libyaml"
brew "lz4"
brew "lzo"
brew "lzop"
brew "m-cli"
brew "mas"
brew "mtr"
brew "openssl"
brew "osquery"
brew "p7zip"
brew "packer"
brew "parallel"
brew "pigz"
brew "pwgen"
brew "python"
brew "python3"
brew "rclone"
brew "readline"
brew "ruby-install"
brew "shellcheck"
brew "siege"
brew "socat"
brew "ssh-copy-id"
brew "sysdig"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "tree"
brew "waflyctl"
brew "wget"
brew "xz"

cask "1password"
cask "alfred"
cask "audio-hijack"
cask "cleanmymac"
cask "docker-edge"
cask "dropbox"
cask "firefox"
cask "fission"
cask "github-desktop"
cask "google-chrome"
cask "gpgtools"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "mysqlworkbench"
cask "rekordbox"
cask "skype"
cask "slack"
cask "spotify"
cask "virtualbox"
cask "vlc"
cask "zerotier-one"
cask "zoomus"

mas "LINE", id: 539883307
mas "Logic Pro X", id: 634148309
mas "Magnet", id: 441258766
mas "Pixelmator", id: 407963104
mas "Telegram", id: 747648890
mas "Webcam Settings", id: 533696630
