tap 'caskroom/cask'
tap 'homebrew/services'
tap 'homebrew/versions'

cask 'java'

brew 'openssl'
brew 'git'
brew 'atomicparsley'
brew 'readline'
brew 'python'
brew 'awscli'
brew 'bats'
brew 'bfg'
brew 'caddy'
brew 'chromedriver'
brew 'chruby'
brew 'consul'
brew 'consul-template'
brew 'coreutils'
brew 'csshx'
brew 'ctop'
brew 'ettercap'
brew 'ffmpeg', args: %w[with-openssl with-rtmpdump with-opus with-sdl2 with-webp with-libvorbis with-libvpx with-openssl with-rtmpdump with-tools with-x265]
brew 'findutils'
brew 'webp'
brew 'geoip'
brew 'diff-so-fancy'
brew 'git-flow'
brew 'git-utils'
brew 'go'
brew 'xz'
brew 'python3'
brew 'grc'
brew 'hashcat'
brew 'heroku'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'hyper'
brew 'imagemagick@6'
brew 'iperf3'
brew 'jq'
brew 'kubernetes-cli'
brew 'lz4'
brew 'lzo'
brew 'lzop'
brew 'm-cli'
brew 'mailhog'
brew 'protobuf'
brew 'mitmproxy'
brew 'msgpack'
brew 'mtr'
brew 'mysql', restart_service: true
brew 'redis', restart_service: true
brew 'nvm'
brew 'osquery'
brew 'p7zip'
brew 'packer'
brew 'parallel'
brew 'percona-toolkit'
brew 'phantomjs'
brew 'pigz'
brew 'postgresql'
brew 'pwgen'
brew 'rclone'
brew 'socat'
brew 'ssh-copy-id'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wireshark'
brew 'yarn'
brew 'z'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'atom-beta'
cask 'audio-hijack'
cask 'calibre'
cask 'chefdk'
cask 'cleanmymac'
cask 'caskroom/versions/docker-edge'
cask 'dropbox'
cask 'firefox'
cask 'fission'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpgtools'
cask 'istat-menus'
cask 'iterm2'
cask 'keybase'
cask 'knox'
cask 'mysqlworkbench'
cask 'nicecast'
cask 'obs'
cask 'popkey'
cask 'qq'
cask 'rekordbox'
cask 'screenhero'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'textual'
cask 'torbrowser'
cask 'tunnelblick'
cask 'unrarx'
cask 'virtualbox'
cask 'vlc'
cask 'vnc-viewer'
cask 'zerotier-one'
cask 'zoomus'

# --------------

# base
brew 'zsh'
brew 'coreutils'
brew 'findutils'

# ruby
brew 'chruby'
brew 'ruby-install'
brew 'readline'

# vim
brew 'vim'

# system
brew 'tree'
brew 'grc'
brew 'wget'
brew 'spark'
brew 'tmux'
brew 'jq'

# nodejs
brew 'nodejs'

# git
brew 'git'
brew 'hub'
brew 'git-flow'
brew 'git-utils'

# dropbox
cask 'dropbox'

# iterm
cask 'iterm2'

# AWS
brew 'awscli'
brew 'ec2-api-tools'
brew 'packer'

# Heroku
brew 'heroku-toolbelt'

mas 'Airmail 3', id: 918858936
mas 'iA Writer', id: 775737590
mas 'LINE', id: 539883307
mas 'Logic Pro X', id: 634148309
mas 'Pixelmator', id: 407963104
mas 'Todoist', id: 585829637
mas 'Tweetbot', id: 557168941
mas 'Webcam Settings', id: 533696630
mas 'BetterSnapTool', id: 417375580
